In [75]:
print("hello")
print("Hello world")

hello
Hello world

In [76]:
"""
This is the file for introduction of the Pandas library in python
"""

'\nThis is the file for introduction of the Pandas library in python\n'

In [77]:
emp = { 'name' : ['Rohit','Virat','Dhoni'] , 
        'email' : ['Rohit@gmail.com','Virat@gmail.com','Dhoni@gmail.com'] ,
        'age' : ['25','26','30']   
}

In [78]:
emp

{'name': ['Rohit', 'Virat', 'Dhoni'],
 'email': ['Rohit@gmail.com', 'Virat@gmail.com', 'Dhoni@gmail.com'],
 'age': ['25', '26', '30']}

In [79]:
print(type(emp))

<class 'dict'>

In [80]:
print(emp['name'])

['Rohit', 'Virat', 'Dhoni']

In [81]:
#Dataframe - variable storing data in memory in the form of rows and columns like table

In [82]:
import pandas as pd

In [83]:
#dictionary to dataframe
df_emp = pd.DataFrame(emp)

In [84]:
names = ['Rohit','Virat','Dhoni']
emails = ['Rohit@gmail.com','Virat@gmail.com','Dhoni@gmail.com']
ages = ['25','26','30'] 

df_ls = pd.DataFrame (
     {
         'Name' : names,
        'email' : emails,
        'age'   : ages
     }
    
)

df_ls

    Name            email age
0  Rohit  Rohit@gmail.com  25
1  Virat  Virat@gmail.com  26
2  Dhoni  Dhoni@gmail.com  30

In [85]:
df_emp

    name            email age
0  Rohit  Rohit@gmail.com  25
1  Virat  Virat@gmail.com  26
2  Dhoni  Dhoni@gmail.com  30

In [86]:
print(type(df_emp))

<class 'pandas.core.frame.DataFrame'>

In [87]:
df_emp['name']

0    Rohit
1    Virat
2    Dhoni
Name: name, dtype: object

In [88]:
print(type(df_emp['name']))

<class 'pandas.core.series.Series'>

In [89]:
df_emp

    name            email age
0  Rohit  Rohit@gmail.com  25
1  Virat  Virat@gmail.com  26
2  Dhoni  Dhoni@gmail.com  30

In [90]:
#accessing index location / integer based
df_emp.iloc[2]

name               Dhoni
email    Dhoni@gmail.com
age                   30
Name: 2, dtype: object

In [91]:
df_emp.iloc[0:2]

    name            email age
0  Rohit  Rohit@gmail.com  25
1  Virat  Virat@gmail.com  26

In [92]:
#dataframe name.iloc[rowsindex,columnsindex]
#accessing range of index location
df_emp.iloc[0:3,0:3]

    name            email age
0  Rohit  Rohit@gmail.com  25
1  Virat  Virat@gmail.com  26
2  Dhoni  Dhoni@gmail.com  30

In [93]:
#accessing specific rows or columns
df_emp.iloc[[0,2],[0,2]]

    name age
0  Rohit  25
2  Dhoni  30

In [94]:
#accessing data based on data
df_emp.loc['Rohit@gmail.com':'Dhoni@gmail.com']

Empty DataFrame
Columns: [name, email, age]
Index: []

In [95]:
df_emp.loc['Rohit':'Dhoni']

Empty DataFrame
Columns: [name, email, age]
Index: []

In [96]:
df_emp.describe()

         name            email age
count       3                3   3
unique      3                3   3
top     Rohit  Rohit@gmail.com  25
freq        1                1   1

In [97]:
df_orders = pd.read_csv('orders.txt')

In [98]:
df_orders

,order_id,order_date,customer_name,city,category,product_id,sales,profit
0,CA-2018-100006,9/7/2018,Dennis Kane,New York City,Technology,TEC-PH-10002075,377.970,109.6113
1,CA-2018-100090,7/8/2018,Ed Braxton,San Francisco,Furniture,FUR-TA-10003715,502.488,-87.9354
2,CA-2018-100293,3/14/2018,Neil Französisch,Jacksonville,Office Supplies,OFF-PA-10000176,91.056,31.8696
3,CA-2018-100328,1/28/2018,Jasper Cacioppo,New York City,Office Supplies,OFF-BI-10000343,3.928,1.3257
4,CA-2018-100363,4/8/2018,Jim Mitchum,Glendale,Office Supplies,OFF-FA-10000611,2.368,0.8288
...,...,...,...,...,...,...,...,...
5009,US-2021-168802,11/3/2021,Jack O'Briant,Seattle,Office Supplies,OFF-BI-10002393,18.368,5.9696
5010,US-2021-169320,7/23/2021,Lena Hernandez,Elkhart,Office Supplies,OFF-AR-10003602,11.680,5.4896
5011,US-2021-169488,9/7/2021,Allen Armold,Providence,Office Supplies,OFF-PA-10000157,39.960,18.7812
5012,US-2021-169502,8/28/2021,Matthew Grinstein,Milwaukee,Office Supplies,OFF-AP-10001947,91.600,26.5640
5013,US-2021-169551,7/7/2021,Rob Lucas,Philadelphia,Furniture,FUR-BO-10001519,87.210,-45.3492

In [99]:
df_orders.head(5)

,order_id,order_date,customer_name,city,category,product_id,sales,profit
0,CA-2018-100006,9/7/2018,Dennis Kane,New York City,Technology,TEC-PH-10002075,377.970,109.6113
1,CA-2018-100090,7/8/2018,Ed Braxton,San Francisco,Furniture,FUR-TA-10003715,502.488,-87.9354
2,CA-2018-100293,3/14/2018,Neil Französisch,Jacksonville,Office Supplies,OFF-PA-10000176,91.056,31.8696
3,CA-2018-100328,1/28/2018,Jasper Cacioppo,New York City,Office Supplies,OFF-BI-10000343,3.928,1.3257
4,CA-2018-100363,4/8/2018,Jim Mitchum,Glendale,Office Supplies,OFF-FA-10000611,2.368,0.8288

In [100]:
df_orders.tail(5)

,order_id,order_date,customer_name,city,category,product_id,sales,profit
5009,US-2021-168802,11/3/2021,Jack O'Briant,Seattle,Office Supplies,OFF-BI-10002393,18.368,5.9696
5010,US-2021-169320,7/23/2021,Lena Hernandez,Elkhart,Office Supplies,OFF-AR-10003602,11.680,5.4896
5011,US-2021-169488,9/7/2021,Allen Armold,Providence,Office Supplies,OFF-PA-10000157,39.960,18.7812
5012,US-2021-169502,8/28/2021,Matthew Grinstein,Milwaukee,Office Supplies,OFF-AP-10001947,91.600,26.5640
5013,US-2021-169551,7/7/2021,Rob Lucas,Philadelphia,Furniture,FUR-BO-10001519,87.210,-45.3492

In [101]:
df_orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5014 entries, 0 to 5013
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       5012 non-null   object
 1   order_date     5012 non-null   object
 2   customer_name  5012 non-null   object
 3   city           5012 non-null   object
 4   category       5012 non-null   object
 5   product_id     5012 non-null   object
 6   sales          5012 non-null   float64
 7   profit         5012 non-null   float64
dtypes: float64(2), object(6)
memory usage: 313.5+ KB

In [102]:
df_orders.describe()

              sales       profit
count   5012.000000  5012.000000
mean     221.342152    21.087054
std      470.190145   168.680059
min        0.444000 -2929.484500
25%       16.774000     1.069500
50%       56.564000     7.487200
75%      225.364000    26.485050
max    10499.970000  5039.985600